/*
 Navicat Premium Data Transfer

 Source Server         : learn
 Source Server Type    : MySQL
 Source Server Version : 80034 (8.0.34)
 Source Host           : localhost:3306
 Source Schema         : library

 Target Server Type    : MySQL
 Target Server Version : 80034 (8.0.34)
 File Encoding         : 65001

 Date: 19/09/2023 14:18:44
*/

SET NAMES utf8mb4;
SET FOREIGN_KEY_CHECKS = 0;

-- ----------------------------
-- Table structure for books_book
-- ----------------------------
DROP TABLE IF EXISTS `books_book`;
CREATE TABLE `books_book`  (
  `id` bigint NOT NULL AUTO_INCREMENT,
  `bookname` varchar(64) CHARACTER SET utf8mb3 COLLATE utf8mb3_general_ci NOT NULL,
  `author` varchar(64) CHARACTER SET utf8mb3 COLLATE utf8mb3_general_ci NOT NULL,
  `isbn` varchar(20) CHARACTER SET utf8mb3 COLLATE utf8mb3_general_ci NOT NULL,
  `Listing_time` date NOT NULL,
  `updated_time` datetime(6) NOT NULL,
  `type` varchar(32) CHARACTER SET utf8mb3 COLLATE utf8mb3_general_ci NOT NULL,
  `lang` varchar(32) CHARACTER SET utf8mb3 COLLATE utf8mb3_general_ci NOT NULL,
  `publisher` varchar(32) CHARACTER SET utf8mb3 COLLATE utf8mb3_general_ci NOT NULL,
  `price` decimal(8, 2) NOT NULL,
  `intro` varchar(512) CHARACTER SET utf8mb3 COLLATE utf8mb3_general_ci NOT NULL,
  `pic` varchar(64) CHARACTER SET utf8mb3 COLLATE utf8mb3_general_ci NOT NULL,
  PRIMARY KEY (`id`) USING BTREE,
  UNIQUE INDEX `isbn`(`isbn` ASC) USING BTREE
) ENGINE = InnoDB AUTO_INCREMENT = 28 CHARACTER SET = utf8mb3 COLLATE = utf8mb3_general_ci ROW_FORMAT = Dynamic;

-- ----------------------------
-- Records of books_book
-- ----------------------------
INSERT INTO `books_book` VALUES (1, '红与黑', '（法）司汤达 著', '9787544629362', '2015-10-01', '2023-09-10 11:12:23.335472', '文学，语言', '法文', '上海外语教育出版社', 43.00, '《红与黑》是法国作家司汤达的代表作，是19世纪欧洲批判现实主义文学的奠基作品。', 'http://localhost:8000/static/books/9787544629362.jpg');
INSERT INTO `books_book` VALUES (2, '长安的荔枝', '马伯庸', '9787572608582', '2022-10-01', '2023-09-10 11:21:47.546630', '其他', '中文', '湖南文艺出版社', 45.00, '大唐天宝十四年，长安城的小吏李善德突然接到一个任务：要在贵妃诞辰之日前，从岭南运来新鲜荔枝。荔枝“一日色变，两日香变，三日味变”，而从岭南距长安五千余里，山水迢迢，这是个不可能完成的任务，可是为了家人，李善德决定放手一搏：“就算失败，我也想知道，自己倒在距终点多远的地方”', 'http://localhost:8000/static/books/9787572608582.jpg');
INSERT INTO `books_book` VALUES (3, '三体', '刘慈欣', '9787229166922', '2018-12-01', '2023-09-10 13:00:44.734007', '精品小说-科幻经典', '中文', '海南省电子音像出版社', 39.99, '刘慈欣经典科幻代表作 每个人的书架上都该有套《三体》！关于宇宙最狂野的想象！就是它！征服世界的中国科幻神作！包揽九项世界顶级科幻大奖！', 'http://localhost:8000/static/books/9787229166922.jpg');
INSERT INTO `books_book` VALUES (4, '明朝那些事（全集）', '当年明月', '9787801656179', '2011-12-01', '2023-09-10 13:05:36.119040', '历史-历史读物', '中文', '浙江人民出版社', 299.00, '一本书让你爱上历史。 《明朝那些事儿》主要讲述的是从1344年到1644年这三百年间关于明朝的一些故事。以史料为基础，以年代和具体人物为主线，并加入了小说的笔法，语言幽默风趣。', 'http://localhost:8000/static/books/9787801656179.jpg');
INSERT INTO `books_book` VALUES (5, '活着', '余华', '9787530221532', '2012-08-01', '2023-09-10 13:10:13.653358', '文学-经典作品', '中文', '作家出版社', 29.99, '《活着》是一篇读起来让人感到沉重的小说。那种只有阖上书本才会感到的隐隐不快，并不是由作品提供的故事的残酷造成的。毕竟，作品中的亡家，丧妻，失女以及白发人送黑发人这样的故事并不具备轰动性。', 'http://localhost:8000/static/books/9787530221532.jpg');
INSERT INTO `books_book` VALUES (6, '平凡的世界（全三部）', '路遥', '9787530221396', '2021-06-01', '2023-09-10 13:14:39.084114', '文学-经典作品', '中文', '北京十月文艺出版社', 138.00, '《平凡的世界》是路遥的长篇代表作，曾获第三届茅盾文学奖，并入选“新中国70年70部长篇小说典藏”，得到各界名家的一致推荐。', 'http://localhost:8000/static/books/9787530221396.jpg');
INSERT INTO `books_book` VALUES (7, '追风筝的人', '[美] 卡勒德·胡赛尼', '9787208061644', '2006-05-01', '2023-09-10 13:17:06.293066', '文学-外国文学', '中文', '上海人民出版社', 29.00, '12岁的阿富汗富家少爷阿米尔与仆人哈桑情同手足。然而，在一场风筝比赛后，发生了一件悲惨不堪的事，阿米尔为自己的懦弱感到自责和痛苦，逼走了哈桑，不久，自己也跟随父亲逃往美国。', 'http://localhost:8000/static/books/9787208061644.jpg');
INSERT INTO `books_book` VALUES (8, '杀死一只知更鸟', '[美国] 哈珀·李', '9787544766500', '2017-02-01', '2023-09-10 13:20:01.048315', '精品小说，文学-世界名著', '中文', '译林出版社', 58.00, '《杀死一只知更鸟》是公认的美国文学经典，而它在教育领域的意义却使其突破了国界，成为世界上最有名的成长小说之一。《杀死一只知更鸟》在西方世界的影响力巨大，是美国中小学的必读书目，图书馆借阅次数最高的图书，以及英国青少年最喜爱的图书，在最近一次民意投票中，它甚至压倒《圣经》，成为“最具启示意义的书”。', 'http://localhost:8000/static/books/9787544766500.jpg');
INSERT INTO `books_book` VALUES (9, '南京大屠杀', '9787508653389', '9787508653389', '2015-08-01', '2023-09-10 13:22:15.372753', '历史-中国史', '中文', '中信出版社', 49.00, '1937年12月，日军攻入中国古都南京。几周之内，30多万中国平民和士兵遭到有计划地强暴、折磨和屠杀——死亡人数超过广岛和长崎原子弹爆炸遇难人数的总和。  张纯如不仅在书中详述了日军疯狂暴行的细节，而且分析了在军国主义文化背景下成长起来的日本士兵对人类生命的漠视。张纯如对南京大屠杀的幸存者进行了大量采访，并首次发掘了许多重要文献。', 'http://localhost:8000/static/books/9787508653389.jpg');
INSERT INTO `books_book` VALUES (10, '白夜行', '[日] 东野圭吾', '9787544258609', '2013-01-01', '2023-09-10 13:24:49.082633', '精品小说-悬疑推理', '中文', '南海出版社', 39.50, '《白夜行》是东野圭吾迄今口碑最好的长篇杰作，具备经典名著的一切要素：  一宗离奇命案牵出跨度近20年步步惊心的故事：悲凉的爱情、吊诡的命运、令人发指的犯罪、复杂人性的对决与救赎……', 'http://localhost:8000/static/books/9787544258609.jpg');
INSERT INTO `books_book` VALUES (11, '白鹿原', '陈忠实', '9787020090297', '1993-06-01', '2023-09-10 13:27:20.079773', '文学经典作品', '中文', '人民文学出版社', 39.00, '在从清末民初到建国之初的半个世纪里，一阵阵狂风掠过了白鹿原上空，而每一次的变动都震荡着它的内在结构：打乱了再恢复，恢复了再打乱，细腻地反映出白姓和鹿姓两大家族祖孙三代的恩怨纷争。陈忠实先生在这里，人物的命运是纵线，百回千转，社会历史的演进是横面，愈拓愈宽，传统文化的兴衰则是全书的精神主体，以至人、社会历史、文化精神三者之间相互激荡，相互作用，共同推进了作品的时空，在我们眼前铺开了一轴恢宏的、动态的、极富纵深感的关于我们民族灵魂的现实主义的画卷。', 'http://localhost:8000/static/books/9787020090297.jpg');
INSERT INTO `books_book` VALUES (12, '我们仨', '杨绛', '9787108018809', '2003-07-01', '2023-09-10 13:29:59.055242', '人物传记', '中文', '生活·读书·新知三联书店', 18.80, '《我们仨》是钱钟书夫人杨绛撰写的家庭生活回忆录。1998年，钱钟书逝世，而他和杨绛唯一的女儿钱瑗已于此前（1997年）先他们而去。在人生的伴侣离去四年后，杨绛在92岁高龄的时候用心记述了他们这个特殊家庭63年的风风雨雨、点点滴滴，结成回忆录《我们仨》。', 'http://localhost:8000/static/books/9787108018809.jpg');
INSERT INTO `books_book` VALUES (13, '小王子', '[法国] 安东尼·德·圣-埃克苏佩里', '9787020042494', '2003-08-01', '2023-09-10 13:35:15.111684', '文学-外国文学', '中文', '人民文学出版社', 22.00, '小王子是一个超凡脱俗的仙童，他住在一颗只比他大一丁点儿的小行星上。陪伴他的是一朵他非常喜爱的小玫瑰花。但玫瑰花的虚荣心伤害了小王子对她的感情。', 'http://localhost:8000/static/books/9787020042494.jpg');
INSERT INTO `books_book` VALUES (14, '一个叫欧维的男人决定去死', '[瑞典] 弗雷德里克·巴克曼', '9787541142185', '2015-12-09', '2023-09-10 13:37:43.165399', '文学-经典作品', '中文', '四川文艺出版社', 35.00, '来认识一下欧维，这个59岁的老头，脾气古怪，带着坚不可摧的原则、每天恪守的常规以及随时发飙的脾性在社区晃来晃去，被背地里称为“地狱来的恶邻”。他每天一大早就四处巡视，搬动没停进格线的脚踏车，检查垃圾是否按规定分类，抱怨谁家的草坪还不修剪，诅咒那只掉了毛的流浪猫。没完没了 。', 'http://localhost:8000/static/books/9787541142185.jpg');
INSERT INTO `books_book` VALUES (15, '置身事内：中国政府与经济发展', '兰小欢', '9787208171336', '2021-01-23', '2023-09-10 13:40:29.652268', '经济理财-财经', '中文', '上海人民出版社', 65.00, '“在成功的经济体中，经济政策一定是务实的，不是意识形态化的。是具体的，不是抽象的。”  直面真问题、深究真逻辑的复旦大学经济学“毕业课”', 'http://localhost:8000/static/books/9787208171336.jpg');
INSERT INTO `books_book` VALUES (16, '围城', '钱钟书', '9787020127894', '2017-07-28', '2023-09-10 13:42:54.269540', '文学-经典作品', '中文', '人民文学出版社', 36.00, '《围城》是钱钟书仅有的一部长篇小说，堪称中国现当代长篇小说的经典。小说塑造了抗战开初一类知识分子的群像，生动反映了在国家特定时期，特殊人群的行为操守、以及困惑。', 'http://localhost:8000/static/books/9787020127894.jpg');
INSERT INTO `books_book` VALUES (17, '东汉至魏晋时期的瘟疫、战争与社会', '袁灿兴', '9787553818016', '2023-08-10', '2023-09-17 15:05:27.002422', '文学-经典作品', '中文', '岳麓书社', 88.00, '\'\'', 'http://localhost:8000/static/books/9787553818016.jpg');
INSERT INTO `books_book` VALUES (18, '冰路狂花', '[美]埃米·布彻', '9787559861030', '2023-09-05', '2023-09-17 15:06:53.459323', '文学-经典作品', '中文', '广西师范大学出版社', 68.00, '\'\'', 'http://localhost:8000/static/books/9787559861030.jpg');
INSERT INTO `books_book` VALUES (19, '写作是一把刀', '[法]安妮·埃尔诺', '9787208182721', '2023-08-06', '2023-09-17 15:08:19.844328', '文学-外国文学', '中文', '上海人民出版社', 58.00, '\'\'', 'http://localhost:8000/static/books/9787208182721.jpg');
INSERT INTO `books_book` VALUES (20, '重读鲁迅', '[美]鲍凯琳(Carolyn T. Brown', '9787308235372', '2023-08-12', '2023-09-17 15:10:25.070676', '文学，语言', '中文', '浙江大学出版社出品方:启真馆', 69.00, '\'\'', 'http://localhost:8000/static/books/9787308235372.jpg');
INSERT INTO `books_book` VALUES (21, '思想之诗', '[美]乔治·斯坦纳', '9787559858184', '2023-08-23', '2023-09-17 15:11:53.351842', '文学-外国文学', '中文', '广西师范大学出版社出品方:新民说', 79.00, '\'\'', 'http://localhost:8000/static/books/9787559858184.jpg');
INSERT INTO `books_book` VALUES (22, '明清白莲教社会历史调查', '曹新宇', '9787100184168', '2023-08-15', '2023-09-17 15:13:12.383216', '历史-历史读物', '中文', '商务印书馆', 128.00, '‘’', 'http://localhost:8000/static/books/9787100184168.jpg');
INSERT INTO `books_book` VALUES (23, '为书籍的一生', '汪家明', '9787108064370', '2023-08-21', '2023-09-17 15:14:21.814133', '文学，其他', '中文', '生活·读书·新知三联书店', 59.00, '\'\'', 'http://localhost:8000/static/books/9787108064370.jpg');
INSERT INTO `books_book` VALUES (24, '消费图像', '[美]斯图亚特·埃文', '9787568938945', '2023-08-21', '2023-09-17 15:15:40.135547', '其他', '中文', '重庆大学出版社出品方:拜德雅', 88.00, '\'\'', 'http://localhost:8000/static/books/9787568938945.jpg');
INSERT INTO `books_book` VALUES (25, '杂文的自觉', '张旭东', '9787108059345', '2023-08-20', '2023-09-17 15:17:22.995000', '其他', '中文', '生活·读书·新知三联书店', 168.00, '\'\'', 'http://localhost:8000/static/books/9787108059345.jpg');
INSERT INTO `books_book` VALUES (26, '风痕', '潘绥铭', '9787108075864', '2023-09-21', '2023-09-17 15:18:13.348646', '其他', '中文', '生活·读书·新知三联书店', 63.00, '\'\'', 'http://localhost:8000/static/books/9787108075864.jpg');
INSERT INTO `books_book` VALUES (27, '薄如晨曦', ' [法] 玛丽斯·孔戴', '9787522518114', '2023-09-01', '2023-09-19 04:06:09.384939', '语言，文学', '中文', '九州出版社', 62.00, '布克奖入围、新学院奖得主，法语文学重要女作家玛丽斯·孔戴代表作首次引进！\n\n“猎巫”为背景，以严肃写实+瑰丽想象，\n\n书写底层女性的成长与觉醒，\n\n赞颂每一个桀骜、自由、勇敢的女性。', 'http://localhost:8000/static/books/9787522518114.jpg');

SET FOREIGN_KEY_CHECKS = 1;
