# 将第一个组数据和第二个组数据分别存储在两个列表中
data1 = [

    '红与黑',
    '长安的荔枝',
    '三体',
    '明朝那些事（全集）',
    '活着',
    '平凡的世界（全三部）',
    '追风筝的人',
    '杀死一只知更鸟',
    '南京大屠杀',
    '白夜行',
    '白鹿原',
    '我们仨',
    '小王子',
    '一个叫欧维的男人决定去死',
    '置身事内：中国政府与经济发展',
    '围城',
    '东汉至魏晋时期的瘟疫、战争与社会',
    '冰路狂花',
    '写作是一把刀',
    '重读鲁迅',
    '思想之诗',
    '明清白莲教社会历史调查',
    '为书籍的一生',
    '消费图像',
    '杂文的自觉',
    '风痕'
]

data2 = [
    9787544629362,
    9787572608582,
    9787229166922,
    9787801656179,
    9787530221532,
    9787530221396,
    9787208061644,
    9787544766500,
    9787508653389,
    9787544258609,
    9787020090297,
    9787108018809,
    9787020042494,
    9787541142185,
    9787208171336,
    9787020127894,
    9787553818016,
    9787559861030,
    9787208182721,
    9787308235372,
    9787559858184,
    9787100184168,
    9787108064370,
    9787568938945,
    9787108059345,
    9787108075864,
]

# 创建一个空列表来存储转换后的数据
result = []

# 遍历两个列表，并将它们一一对应转换成所需的形式
for value, link in zip(data1, data2):
    book = {'value': value, 'link': link}
    result.append(book)

# 打印转换后的数据
for book in result:
    print(book)
